GopalSaraf/Practicals/PSDL/include/proc/pic18lf8621.inc
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18LF8621_INC_
#define _PIC18LF8621_INC_

/*
 * Assembly Header file for the Microchip PIC Microcontroller
 * PIC18LF8621
 */

/*
 * Device Registers
 */

// Register: ECCP2DEL
#define ECCP2DEL ECCP2DEL
ECCP2DEL                                 equ 0F67h
// bitfield definitions
ECCP2DEL_P2DC_POSN                       equ 0000h
ECCP2DEL_P2DC_POSITION                   equ 0000h
ECCP2DEL_P2DC_SIZE                       equ 0007h
ECCP2DEL_P2DC_LENGTH                     equ 0007h
ECCP2DEL_P2DC_MASK                       equ 007Fh
ECCP2DEL_P2RSEN_POSN                     equ 0007h
ECCP2DEL_P2RSEN_POSITION                 equ 0007h
ECCP2DEL_P2RSEN_SIZE                     equ 0001h
ECCP2DEL_P2RSEN_LENGTH                   equ 0001h
ECCP2DEL_P2RSEN_MASK                     equ 0080h
ECCP2DEL_P2DC0_POSN                      equ 0000h
ECCP2DEL_P2DC0_POSITION                  equ 0000h
ECCP2DEL_P2DC0_SIZE                      equ 0001h
ECCP2DEL_P2DC0_LENGTH                    equ 0001h
ECCP2DEL_P2DC0_MASK                      equ 0001h
ECCP2DEL_P2DC1_POSN                      equ 0001h
ECCP2DEL_P2DC1_POSITION                  equ 0001h
ECCP2DEL_P2DC1_SIZE                      equ 0001h
ECCP2DEL_P2DC1_LENGTH                    equ 0001h
ECCP2DEL_P2DC1_MASK                      equ 0002h
ECCP2DEL_P2DC2_POSN                      equ 0002h
ECCP2DEL_P2DC2_POSITION                  equ 0002h
ECCP2DEL_P2DC2_SIZE                      equ 0001h
ECCP2DEL_P2DC2_LENGTH                    equ 0001h
ECCP2DEL_P2DC2_MASK                      equ 0004h
ECCP2DEL_P2DC3_POSN                      equ 0003h
ECCP2DEL_P2DC3_POSITION                  equ 0003h
ECCP2DEL_P2DC3_SIZE                      equ 0001h
ECCP2DEL_P2DC3_LENGTH                    equ 0001h
ECCP2DEL_P2DC3_MASK                      equ 0008h
ECCP2DEL_P2DC4_POSN                      equ 0004h
ECCP2DEL_P2DC4_POSITION                  equ 0004h
ECCP2DEL_P2DC4_SIZE                      equ 0001h
ECCP2DEL_P2DC4_LENGTH                    equ 0001h
ECCP2DEL_P2DC4_MASK                      equ 0010h
ECCP2DEL_P2DC5_POSN                      equ 0005h
ECCP2DEL_P2DC5_POSITION                  equ 0005h
ECCP2DEL_P2DC5_SIZE                      equ 0001h
ECCP2DEL_P2DC5_LENGTH                    equ 0001h
ECCP2DEL_P2DC5_MASK                      equ 0020h
ECCP2DEL_P2DC6_POSN                      equ 0006h
ECCP2DEL_P2DC6_POSITION                  equ 0006h
ECCP2DEL_P2DC6_SIZE                      equ 0001h
ECCP2DEL_P2DC6_LENGTH                    equ 0001h
ECCP2DEL_P2DC6_MASK                      equ 0040h
ECCP2DEL_PDC0_POSN                       equ 0000h
ECCP2DEL_PDC0_POSITION                   equ 0000h
ECCP2DEL_PDC0_SIZE                       equ 0001h
ECCP2DEL_PDC0_LENGTH                     equ 0001h
ECCP2DEL_PDC0_MASK                       equ 0001h
ECCP2DEL_PDC1_POSN                       equ 0001h
ECCP2DEL_PDC1_POSITION                   equ 0001h
ECCP2DEL_PDC1_SIZE                       equ 0001h
ECCP2DEL_PDC1_LENGTH                     equ 0001h
ECCP2DEL_PDC1_MASK                       equ 0002h
ECCP2DEL_PDC2_POSN                       equ 0002h
ECCP2DEL_PDC2_POSITION                   equ 0002h
ECCP2DEL_PDC2_SIZE                       equ 0001h
ECCP2DEL_PDC2_LENGTH                     equ 0001h
ECCP2DEL_PDC2_MASK                       equ 0004h
ECCP2DEL_PDC3_POSN                       equ 0003h
ECCP2DEL_PDC3_POSITION                   equ 0003h
ECCP2DEL_PDC3_SIZE                       equ 0001h
ECCP2DEL_PDC3_LENGTH                     equ 0001h
ECCP2DEL_PDC3_MASK                       equ 0008h
ECCP2DEL_PDC4_POSN                       equ 0004h
ECCP2DEL_PDC4_POSITION                   equ 0004h
ECCP2DEL_PDC4_SIZE                       equ 0001h
ECCP2DEL_PDC4_LENGTH                     equ 0001h
ECCP2DEL_PDC4_MASK                       equ 0010h
ECCP2DEL_PDC5_POSN                       equ 0005h
ECCP2DEL_PDC5_POSITION                   equ 0005h
ECCP2DEL_PDC5_SIZE                       equ 0001h
ECCP2DEL_PDC5_LENGTH                     equ 0001h
ECCP2DEL_PDC5_MASK                       equ 0020h
ECCP2DEL_PDC6_POSN                       equ 0006h
ECCP2DEL_PDC6_POSITION                   equ 0006h
ECCP2DEL_PDC6_SIZE                       equ 0001h
ECCP2DEL_PDC6_LENGTH                     equ 0001h
ECCP2DEL_PDC6_MASK                       equ 0040h
ECCP2DEL_PRSEN_POSN                      equ 0007h
ECCP2DEL_PRSEN_POSITION                  equ 0007h
ECCP2DEL_PRSEN_SIZE                      equ 0001h
ECCP2DEL_PRSEN_LENGTH                    equ 0001h
ECCP2DEL_PRSEN_MASK                      equ 0080h

// Register: ECCP2AS
#define ECCP2AS ECCP2AS
ECCP2AS                                  equ 0F68h
// bitfield definitions
ECCP2AS_PSS2BD_POSN                      equ 0000h
ECCP2AS_PSS2BD_POSITION                  equ 0000h
ECCP2AS_PSS2BD_SIZE                      equ 0002h
ECCP2AS_PSS2BD_LENGTH                    equ 0002h
ECCP2AS_PSS2BD_MASK                      equ 0003h
ECCP2AS_PSS2AC_POSN                      equ 0002h
ECCP2AS_PSS2AC_POSITION                  equ 0002h
ECCP2AS_PSS2AC_SIZE                      equ 0002h
ECCP2AS_PSS2AC_LENGTH                    equ 0002h
ECCP2AS_PSS2AC_MASK                      equ 000Ch
ECCP2AS_ECCP2AS_POSN                     equ 0004h
ECCP2AS_ECCP2AS_POSITION                 equ 0004h
ECCP2AS_ECCP2AS_SIZE                     equ 0003h
ECCP2AS_ECCP2AS_LENGTH                   equ 0003h
ECCP2AS_ECCP2AS_MASK                     equ 0070h
ECCP2AS_ECCP2ASE_POSN                    equ 0007h
ECCP2AS_ECCP2ASE_POSITION                equ 0007h
ECCP2AS_ECCP2ASE_SIZE                    equ 0001h
ECCP2AS_ECCP2ASE_LENGTH                  equ 0001h
ECCP2AS_ECCP2ASE_MASK                    equ 0080h
ECCP2AS_PSS2BD0_POSN                     equ 0000h
ECCP2AS_PSS2BD0_POSITION                 equ 0000h
ECCP2AS_PSS2BD0_SIZE                     equ 0001h
ECCP2AS_PSS2BD0_LENGTH                   equ 0001h
ECCP2AS_PSS2BD0_MASK                     equ 0001h
ECCP2AS_PSS2BD1_POSN                     equ 0001h
ECCP2AS_PSS2BD1_POSITION                 equ 0001h
ECCP2AS_PSS2BD1_SIZE                     equ 0001h
ECCP2AS_PSS2BD1_LENGTH                   equ 0001h
ECCP2AS_PSS2BD1_MASK                     equ 0002h
ECCP2AS_PSS2AC0_POSN                     equ 0002h
ECCP2AS_PSS2AC0_POSITION                 equ 0002h
ECCP2AS_PSS2AC0_SIZE                     equ 0001h
ECCP2AS_PSS2AC0_LENGTH                   equ 0001h
ECCP2AS_PSS2AC0_MASK                     equ 0004h
ECCP2AS_PSS2AC1_POSN                     equ 0003h
ECCP2AS_PSS2AC1_POSITION                 equ 0003h
ECCP2AS_PSS2AC1_SIZE                     equ 0001h
ECCP2AS_PSS2AC1_LENGTH                   equ 0001h
ECCP2AS_PSS2AC1_MASK                     equ 0008h
ECCP2AS_ECCP2AS0_POSN                    equ 0004h
ECCP2AS_ECCP2AS0_POSITION                equ 0004h
ECCP2AS_ECCP2AS0_SIZE                    equ 0001h
ECCP2AS_ECCP2AS0_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS0_MASK                    equ 0010h
ECCP2AS_ECCP2AS1_POSN                    equ 0005h
ECCP2AS_ECCP2AS1_POSITION                equ 0005h
ECCP2AS_ECCP2AS1_SIZE                    equ 0001h
ECCP2AS_ECCP2AS1_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS1_MASK                    equ 0020h
ECCP2AS_ECCP2AS2_POSN                    equ 0006h
ECCP2AS_ECCP2AS2_POSITION                equ 0006h
ECCP2AS_ECCP2AS2_SIZE                    equ 0001h
ECCP2AS_ECCP2AS2_LENGTH                  equ 0001h
ECCP2AS_ECCP2AS2_MASK                    equ 0040h
ECCP2AS_PSSBD0_POSN                      equ 0000h
ECCP2AS_PSSBD0_POSITION                  equ 0000h
ECCP2AS_PSSBD0_SIZE                      equ 0001h
ECCP2AS_PSSBD0_LENGTH                    equ 0001h
ECCP2AS_PSSBD0_MASK                      equ 0001h
ECCP2AS_PSSBD1_POSN                      equ 0001h
ECCP2AS_PSSBD1_POSITION                  equ 0001h
ECCP2AS_PSSBD1_SIZE                      equ 0001h
ECCP2AS_PSSBD1_LENGTH                    equ 0001h
ECCP2AS_PSSBD1_MASK                      equ 0002h
ECCP2AS_PSSAC0_POSN                      equ 0002h
ECCP2AS_PSSAC0_POSITION                  equ 0002h
ECCP2AS_PSSAC0_SIZE                      equ 0001h
ECCP2AS_PSSAC0_LENGTH                    equ 0001h
ECCP2AS_PSSAC0_MASK                      equ 0004h
ECCP2AS_PSSAC1_POSN                      equ 0003h
ECCP2AS_PSSAC1_POSITION                  equ 0003h
ECCP2AS_PSSAC1_SIZE                      equ 0001h
ECCP2AS_PSSAC1_LENGTH                    equ 0001h
ECCP2AS_PSSAC1_MASK                      equ 0008h

